from django.db.models import TextChoices


class LegalFormChoices(TextChoices):
    """Організаційно-правові форми юр. осіб."""

    OSBB = "ОБ'ЄДНАННЯ СПІВВЛАСНИКІВ БАГАТОКВАРТИРНОГО БУДИНКУ", "ОСББ"
    ZHBK = "ЖИТЛОВО-БУДІВЕЛЬНИЙ КООПЕРАТИВ", "ЖБК"
    TOV = "ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ", "ТОВ"
    PRAT = "ПРИВАТНЕ АКЦІОНЕРНЕ ТОВАРИСТВО", "ПрАТ"
    FOP = "ФІЗИЧНА ОСОБА-ПІДПРИЄМЕЦЬ", "ФОП"
    GO = "ГРОМАДСЬКА ОРГАНІЗАЦІЯ", "ГО"
    PP = "ПРИВАТНЕ ПІДПРИЄМСТВО", "ПП"
    MU = "Військова частина", "ВЧ"
    WITHOUT = " ", "Не вказувати"


class PersonPositionChoices(TextChoices):
    """Посади осіб."""

    CHAIRMAN = "Голова правління", "Голова правління"
    DIRECTOR = "Директор", "Директор"
    HEADMAN = "Начальник", "Начальник"
    COMMANDER = "Командир", "Командир"
    ACTING_DIRECTOR = "Виконуючий обов\'язки директора", "В.о директора",
    WITHOUT = " ", "Без посади"

class CityObjectTypeChoices(TextChoices):
    """Типи об'єктів міста."""

    STREET = "вулиця", "вулиця"
    LANE = "провулок", "провулок"
    BOULEVARD = "бульвар", "бульвар"
    AVENUE = "проспект", "проспект"
    ALLEY = "алея", "алея"
    DESCENT = "узвіз", "узвіз"
    EMBANKMENT = "набережна", "набережна"
    SQUARE = "площа", "площа"
    HIGHWAY = "шоссе", "шоссе"