from django.db.models import TextChoices


class LegalFormChoices(TextChoices):
    """Організаційно-правові форми юр. осіб."""

    OSBB = "ОБ'ЄДНАННЯ СПІВВЛАСНИКІВ БАГАТОКВАРТИРНОГО БУДИНКУ", "ОСББ"
    ZHBK = "ЖИТЛОВО-БУДІВЕЛЬНИЙ КООПЕРАТИВ", "ЖБК"
    TOV = "ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ", "ТОВ"
    PRAT = "ПРИВАТНЕ АКЦІОНЕРНЕ ТОВАРИСТВО", "ПрАТ"
    FOP = "ФІЗИЧНА ОСОБА-ПІДПРИЄМЕЦЬ", "ФОП"
    GO = "ГРОМАДСЬКА ОРГАНІЗАЦІЯ", "ГО"
    PP = "ПРИВАТНЕ ПІДПРИЄМСТВО", "ПП"
    KP = "КОМУНАЛЬНЕ ПІДПРИЄМСТВО", "КП"
    MU = "Військова частина", "ВЧ"


class PersonPositionChoices(TextChoices):
    """Посади осіб."""

    CHAIRMAN = "Голова правління", "Голова правління"
    DIRECTOR = "Директор", "Директор"
    HEADMAN = "Начальник", "Начальник"
    COMMANDER = "Командир", "Командир"
    ACTING_DIRECTOR = (
        "Виконуючий обов'язки директора",
        "В.о директора",
    )
    WITHOUT = " ", "Без посади"


class CityObjectTypeChoices(TextChoices):
    """Типи об'єктів міста."""

    STREET = "вулиця", "вулиця"
    LANE = "провулок", "провулок"
    BOULEVARD = "бульвар", "бульвар"
    AVENUE = "проспект", "проспект"
    ALLEY = "алея", "алея"
    DESCENT = "узвіз", "узвіз"
    EMBANKMENT = "набережна", "набережна"
    SQUARE = "площа", "площа"
    HIGHWAY = "шоссе", "шоссе"


class CityOfUkraineChoices(TextChoices):
    """Міста України."""

    DNIPRO = "Дніпро", "Дніпро"
    CHERKASY = "Черкаси", "Черкаси"
    KAMIANSKE = "Кам'янське", "Кам'янське"
    KRYVYY_RIH = "Кривий Ріг", "Кривий Ріг"
    KYIV = "Київ", "Київ"
    SAMARA = "Самар", "Самар"
    PAVLOGRAD = "Павлоград", "Павлоград"
    ZAPORIHIA = "Запоріжжя", "Запоріжжя"
    ZHOVTI_VODY = "Жовті Води", "Жовті Води"
    KREMENCHUK = "Кременчук", "Кременчук"
    SINELNIKOVE = "Синельникове", "Синельникове"
    VERHNODNIPROVSKY = "Верхньодніпровськ", "Верхньодніпровськ"
    POLTAVA = "Полтава", "Полтава"
